Revit 2026 API

# ConnectionValidationInfoGetWarning Method

---

Access specific warning number of warnings generated by reload.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectionValidationWarning GetWarning(
	int index
)
```
```vb
Public Function GetWarning (
	index As Integer
) As ConnectionValidationWarning
```
```cpp
public:
ConnectionValidationWarning^ GetWarning(
	int index
)
```
```fsharp
member GetWarning :
        index : int -> ConnectionValidationWarning
```

#### Parameters

index Int32

#### Return Value

ConnectionValidationWarning

| Exception | Condition |
| --- | --- |
| ArgumentException | Invalid index. |

#### Reference

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace